{
    "projects": [
      {
        "title": "Personal Website",
        "summary": "This is my personal website, hosted on a domain I bought for myself as a birthday gift two years ago when I promised I would finally build it. Credit is due to Victor Santos, who originally modeled the 3D brain mesh, and to the YouTube channel Better Stack for the liquid glass CSS technique that inspired the site’s visual style. It was really hard.",
        "description": "The 3D Brain Portfolio is an advanced WebGL-driven application built with Three.js, featuring a GPU-accelerated particle system, six custom GLSL shaders, and a liquid glass morphism UI. The project visualizes an abstract neural network that users can explore to navigate portfolio sections such as projects, experience, and contact information.\n\nThe architecture relies on Webpack for modular builds, Babel for ES6+ transpilation, and GSAP for complex animations synchronized across subsystems. Particle geometry is powered by three-bas, supporting over 200,000 animated points rendered in real time. The brain mesh, shaders, and camera transitions are orchestrated through a custom engine that manages interactivity, raycasting, and time-based animation states.\n\nUI elements are rendered with CSS blur effects and SVG filters, simulating a liquid glass interface. Navigation transitions seamlessly bridge 3D and 2D environments, transforming floating text into a fixed navigation bar. The project is hosted via Firebase and Heroku, using Express.js for static delivery and compression, achieving 60 FPS performance on mid-range devices.\n\nThe system demonstrates deep knowledge of GPU programming, shader optimization, and browser performance engineering, integrating physics-based effects, post-processing bloom, and adaptive viewport scaling for smooth user interaction.",
        "stack": "Three.js · JavaScript · Heroku · HTML/CSS",
        "blank_line_notes": "Insert blank lines between each paragraph describing the architecture, UI rendering, and performance characteristics for clear formatting on the website."
      }
    ]
  }
  