{
    "projects": [
      {
        "title": "Columbia FaceMash",
        "summary": "An experimental Flask-based web app designed as an implicit association test (IAT) that measures cursor movement and response latency to infer subconscious bias. It doubles as a sandbox for testing ranking algorithms and, inspired by The Social Network, reimagines Zuckerberg's original Facemash concept as a behavioral data study rather than some abhorrent ranking platform.",
        "description": "This project originated as a digital implicit bias experiment, built upon research techniques developed by the social neuroscience professor I assisted as a teaching assistant. Built using Flask, it records the x–y coordinates of the mouse cursor during pairwise decisions, allowing high-resolution analysis of movement paths as users select between two classmate profiles.\n\nEach cursor trajectory provides insight into hesitation and cognitive conflict. Rather than treating a click as a single reaction time, the system converts every decision into a continuous stream of data that reflects the degree of attraction toward each option. From this, the app computes features such as trajectory curvature, velocity, and deviation, which can indicate implicit bias or uncertainty in social judgments.\n\nEach decision also updates an Elo rating algorithm to produce dynamic rankings and demographic trend statistics. The application is password-protected and anonymizes all data. The backend uses SQLite with Flask endpoints for cursor logging, latency analysis, and rating updates, transforming raw mouse data into behavioral metrics.\n\nThe project was both a study in algorithmic ranking and a hands-on implementation of real-time cognitive tracking techniques from social neuroscience. It served as practice in high-frequency data capture, behavioral inference, and backend optimization for psychological experiments.",
        "stack": "Python · Flask · JavaScript · HTML/CSS · SQL · Algorithms · Neuroscience",
        "blank_line_notes": "Insert blank lines between major conceptual sections (experiment design, cursor tracking explanation, Elo algorithm, and research applications) for optimal visual spacing on the website."
      }
    ]
  }
  